package com.company;

public class Main {

    public static void main(String[] args) {

        //скачал все необходимые материалы


        //1. Как вы понимаете взаимоотношение между Сервером и клиентом?
        //   есть некий сервер на котором хранятся необходимые информации и клиент связывается с этим сервером чтобы узнать
        //   необходимую инфу.
        //2. Что такое база данных?
        //   Это совокупность неких систематизированных материалов  чтобы эти материалы могли быть обработаны
        //   с помощью машины
        //3. Что такое таблица?
        //   Это некий график который состоит из строк и столбцов которые могут содержать текст и т.д
        //   таблица используется для упорядочения данных
        //4. Что такое колонка?
        //   выделяемая область со своим названием в котором хранится только предназначенные данные
        //5. Что такое строка в таблице?
        //   это горизонтальная сторона таблицы в которой обычно указываются некие характеристики
    }
}
