package com.company;

public class Main {

    public static void main(String[] args) {
//HW22.A

//        Поискать информацию о том, какие классы стандартной библиотеки Java имеют модификатор final.
//        И ответить на вопрос, почему это было сделано, и что могло произойти если бы этого сделано не было.

        // Math.PI
        // Math.E


        // это сделано для того чтобы никто не смог менять значение.
        // мог произойти хаус.



        //HW22.C

//        1. Что такое модификатор final и зачем он нам?

//        модификатор final нужен для того чтобы некоторые значения оставались постоянными тоесть их нельзя было менять.

//        2. К каким элементам можно применять final?

//        к таким как свойства методы классы обьекты параметры массивы и тд.

//        3. Объясните применение final для разных элементов.

//        если это примитивное свойство то final делает значение постоянным, а  если это ссылочное(массив объект) то объект создается один раз.

//        4. Как вы понимаете не примитивный (ссылочный тип) данных?

//        ссылочные переменные хранят адрес ячейки в которой расположены некоторые данные.

//        5. В чем отличие между примитивным и не примитивными типами данных?

//        примитывные типы данных не могут хранить в себе множество данных, а ссылочные могут.



    }
}
